# Вычисление арифметического выражения
result = 25 + 6 * 8 - 40

# Вывод результата на экран
print("Результат выражения 25 + 6 * 8 - 40:", result)
